<?php
#-----------------------------------------------------------------------------
#1.冒泡排序方法
#-----------------------------------------------------------------------------
#原理：二层循环，第一层循环确定要循环排序的次数，次数为：n-1,第二层循环两两进行
#比较，将当前进行比较的最大数排在进行比较的数的末位，第一次n个数进行两两比较，求#出最大的数排在n的位置，第二次n-1个数进行两两比较，求出最大数排在n-1的位置，依此#类推
#-----------------------------------------------------------------------------
/**
 *冒牌排序
 *@param array $arr 要排序的数组
 *@return array 返回排完序的数组
 */
function bubbleSort($arr){
	$len=count($arr);
	for($i=0;$i<$len;$i++){
		for($j=1;$j<$len-$i;$j++){
			if($arr[$j]<$arr[$j-1]){
				list($arr[$j],$arr[$j-1])=[$arr[$j-1],$arr[$j]];
			}
		}
	}
}
